[UI_TREE]
Machine=Hardware Setting
POWER=Power
TOUCH=Touch Setting

[IPG,CO2]
MPULSE_FREQ=Keep Freq(KHZ)
MPULSE_RELS=Keep Time(us)

[IPG]
MO_DELAY_STEPS=MO Delay(us)
MODECHG_DELAY=Mode Delay(ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE=Work current value type
WORK_CURRENT_TYPEOption= Layer 0| User define
WORK_CURRENT=Set work current(A)

[ALL]
SAFE_DOOR=SafeDoor Guard
SAFE_DOOROption=Disable|Pause|Stop
MARKEND_SCAN=MarkEnd Scan Position
MARKEND_SCANOption=Center|Left Top|Mid Top|Right Top|Right Mid|Right Bottom|Mid Bottom|Left Bottom|Left Mid|User define
MARKEND_X=X Coordinate(mm)
MARKEND_Y=Y Coordinate(mm)

[SCAN]
PREHEAT_ENABLE=Scan preheat
PREHEAT_ENABLEOption=Disable|Enable
PREHEAT_TIME=Preheat time(min)
USE_LIMIT_JUMPDELAY=Jump delay
USE_LIMIT_JUMPDELAYOption=Disable|Enable
LIMIT_JUMPLEN=Limit jump length(mm)
LIMIT_JUMPDELAY_MM=1mm limit jump delay(us)

[BitmapPower]
BitmapPower=Gray bitmap mark
AUT_TIME=Response time(us)
AUT_COFF=Gain factor(0-1)

[Signal]
Signal=Signal Setting
Cycle=Signal triggers on once
MARK_CNT=Mark count after touch
DELAY=Delay after triggering(ms)
DLY_BETWEEN_MARK=Interval between markings(ms)
MARK_END_DELAY=Delay after marked(ms)
MARK_END_PULSE_W=Mark end signal length(ms)
B_MARK_ONCE=Touch Mode
B_MARK_ONCEOption=Level|Rising
Enable_Loop_Mdt=Offline repeate mark
Enable_Loop_MdtOption=Disable|Enable
IOSELCOUNT=I/O Select Mul Doc signal count
ENABLE_CARDTOUCH=Card Touch
ENABLE_CARDTOUCHOption=Disable|Enable

[UI_FACE]
ExportSysPara = Export...
ImportSysPara = Import...
Ok = OK
Cancel = Cancel
Apply = Apply

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------

[DIALOG_POWER]
0=Step 2: Set the hardware configuration of your selected laser
1=Current regulation range (%)
2=Minimum current (%):
3=Maximum current (A):
4=Simulate Q-drive
5=Digital Q-drive
6=Q-drive type
7=Power supply type
8=CO2 laser power size
9=ordinary power supply
10=Quick response power supply
11=greater than or equal to 100W
12=less than 100W
13=maintain pulse setting
14=Frequency (KHZ)
15=release time (us)
16=idle current (%):
17=maximum duty cycle
18=compensation current (%)
19=Laser hardware settings
20=M value setting
21=M value:
22=adjustment coefficient:
23=normal
24=too large
25=too small

[DIALOG_LaserType]
0=Laser-type
1=YAG Laser
2=DP Laser
3=Ultraviolet Laser
4=CO2 Laser
5=Q-switched fiber Laser
6=SPI Laser
7=LD Laser
8=YLPM (HFM-H) laser
9=YLP-V2 laser
10=YLPP laser
11=HFM-A laser
12=HFM-P laser
13=HFM-R laser
14=HFM-J laser
15=MOPA Tunable Pulse Width Laser
16=continuous fiber laser
17=Ultra fast laser

[DIALOG_MODEL]
0=Step 4: Select your preferred control method based on your preferences
1=A brand new control method, easy to operate, and users do not need to set any delay, but can only be used on some lasers.
2=Traditional laser control method, in line with the usage habits of most people, all lasers can use this method.
3=Easy mode
4=Traditional mode
5=Laser marking control mode
6=Square head type
7=single head mode
8=Double head mode

[DIALOG_CONTENT]
0=Step 5: Congratulation! your setting is finished，please save the parameters.

[LaserType_Explain]
0=YAG Laser
1=DP Laser
2=Ultraviolet Laser
3=CO2 Laser
4=Q-switched fiber Laser
5=SPI Laser
6=LD Laser
7=MOPA fiber laser
8=YLP-V2 laser
9=YLPP laser
10=HFM-A laser
11=HFM-P laser
12=HFM-R laser
13=HFM-J laser
14=other

[Model_Explain]
0=CO2 Handy Mode
1=CO2 Traditional Mode
2=Adjust Q、General Power + Digital Q Traditional Mode
3=Adjust Q、General Power + Analogue Q Traditional Mode
4=Adjust Q、Digital Power + Digital Q Traditional Mode
5=Adjust Q、Digital Power + Analogue Q Traditional Mode
6=Adjust Q、EP General Power + Analogue Q Handy Mode
7=Adjust Q、EP Digital Power + Digital Q Handy Mode
8=Adjust Q、EP Digital Power + Analogue Q Handy Mode
9=IPG Mode
10=SPI Handy Mode
11=SPI Traditional Mode
12=LD Mode
13=YLP-M(HFM-H) Traditional Mode
14=YLP-M(HFM-H) Handy Model
15=YLP-V2 Traditional Mode
16=YLP-V2 Handy Model
17=YLPP Traditional Mode
18=YLPP Handy Model
19=HFM-A Traditional Mode
20=HFM-A Handy Model
21=HFM-P Traditional Mode
22=HFM-P Handy Model
23=HFM-R Traditional Mode
24=HFM-R Handy Model
25=HFM-J Traditional Mode
26=HFM-J Handy Model

[DIALOG_ScanType]
0=Step 3: Select the Galvanometer type
1=CXY
2=Other
3=Notice: CXY-Galvanometer need to be preheated.
;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 = Stop machining input port
STATIC_1 = Stop machining output port
STATIC_2 = output port
STATIC_3 = exit
STATIC_4 = Input Port
STATIC_5 = Laser ready for output port
STATIC_6 = Input Port
STATIC_7 = output Port
STATIC_8 = Software ready output port
STATIC_9 = output port
STATIC_10 = Laser power output port
STATIC_11 = Port
STATIC_12 = External red light indication output
STATIC_13 = output port
STATIC_14 = Input Port
STATIC_15 = Marking Accompanying
STATIC_16 = output port
STATIC_17 = Marking end output port
STATIC_18 = output port
STATIC_19 = Pulse width
STATIC_20 = Fiber laser alarm output port
STATIC_21 = output port
STATIC_22 = Start marking port
STATIC_23 = Input Port
IDC_CHECK_LASERWARN = Detect laser alarm
IDC_CHECK_PLUSE_REVERSE = Q signal level reversal
IDC_RADIO_NORMAL = Standard
IDC_RADIO_BICOLORLAMP = Two-color light
IDC_RADIO_TRICOLORLIGHT = Tricolor light

[error]
1=Card was not found!
2=Fail to reset!
3=The card version was mismatch!
4=Warning!
6=Execute Failed!
7=Invalid status!
16=Command Overtime!
17=Command Lost!
18=Interface call exception!
19=Interface used by another program!
20=Z Outrange or Z calitable file lost!
21=Paramter mismatch!
23=Allocate memory error!
100=Offline status!
101=Stop!
1001=PORT1
1002=PORT2
1003=PORT3
1004=PORT4
1005=PORT5
1006=PORT6
1007=PORT7
1008=LASER IN NOT READY
1009=LASER IN OK

;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

; ---------------------------------BEGIN: EMCC\HansLaserSet. dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= Laser setting
IDD_PROPPAGE_POWER= power supply characteristics
IDD_PROPPAGE_SYS_SET=Hardware settings
IDD_PROPPAGE_TOUCH= Pedal settings
IDD_PORT_SET = Port settings

[IDD_DIALOG_HANSLASERSET]
CAPTION=System Settings
IDC_BTN_SAVE= Save
IDCANCEL= Exit
LISTTITLE_NAME= Item name
LISTTITLE_VALUE= value

; ---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg---------------------------------------------------------

